In [35]:
import pymysql
import pandas as pd
import sqlalchemy

In [39]:
engine = sqlalchemy.create_engine('mysql+pymysql://root:XXXXXXX@localhost:3306/testing')

In [43]:
df_fac = pd.read_sql_table('Facilities',engine)
df_fac.head(1)

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5.0,25.0,10000,200

In [44]:
df_book = pd.read_sql_table('Bookings',engine)
df_book.head(1)

   bookid  facid  memid            starttime  slots
0       0      3      1  2012-07-03 11:00:00      2

In [45]:
df_mem = pd.read_sql_table('Members',engine)
df_mem.head(1)

,memid,surname,firstname,address,zipcode,telephone,recommendedby,joindate
0,0,GUEST,GUEST,GUEST,0,(000) 000-0000,,2012-07-01 00:00:00

### **Q1:** Some of the facilities charge a fee to members, but some do not. Please list the names of the facilities that do.

In [46]:
query = '''
SELECT name AS Facility, guestcost AS Cost
FROM Facilities
WHERE guestcost > 0
'''
q1 = pd.read_sql_query(query, engine)
q1

          Facility  Cost
0   Tennis Court 1  25.0
1   Tennis Court 2  25.0
2  Badminton Court  15.5
3     Table Tennis   5.0
4   Massage Room 1  80.0
5   Massage Room 2  80.0
6     Squash Court  17.5
7    Snooker Table   5.0
8       Pool Table   5.0

### **Q2:** How many facilities do not charge a fee to members?

In [47]:
query = '''
SELECT COUNT(membercost) AS no_member_cost
FROM Facilities
WHERE membercost = 0
'''
q2 = pd.read_sql_query(query, engine)
q2

   no_member_cost
0               4

### Q3: How can you produce a list of facilities that charge a fee to members, where the fee is less than 20% of the facility's monthly maintenance cost? Return the facid, facility name, member cost, and monthly maintenance of the facilities in question.

In [48]:
query = '''
SELECT facid AS facility_id, 
       name AS facility_name, 
       membercost AS member_cost,
       monthlymaintenance AS monthly_maintenance
FROM Facilities
WHERE membercost < 0.2 * monthlymaintenance AND
      membercost > 0
'''
q3 = pd.read_sql_query(query, engine)
q3

   facility_id   facility_name  member_cost  monthly_maintenance
0            0  Tennis Court 1          5.0                  200
1            1  Tennis Court 2          5.0                  200
2            4  Massage Room 1          9.9                 3000
3            5  Massage Room 2          9.9                 3000
4            6    Squash Court          3.5                   80

### Q4: How can you retrieve the details of facilities with ID 1 and 5? Write the query without using the OR operator.

In [49]:
query = '''
SELECT *
FROM Facilities
WHERE facid IN (1, 5)
'''
q4 = pd.read_sql_query(query, engine)
q4

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,1,Tennis Court 2,5.0,25.0,8000,200
1,5,Massage Room 2,9.9,80.0,4000,3000

### Q5: How can you produce a list of facilities, with each labelled as 'cheap' or 'expensive', depending on if their monthly maintenance cost is more than $100? Return the name and monthly maintenance of the facilities in question.

In [50]:
query = '''
SELECT name AS Facility, 
       monthlymaintenance AS 'Monthly Maintenance',
       CASE WHEN monthlymaintenance <= 100 THEN 'cheap'
            ELSE 'expensive'
            END AS 'Cost Description'
FROM Facilities
'''
q5 = pd.read_sql_query(query, engine)
q5

          Facility  Monthly Maintenance Cost Description
0   Tennis Court 1                  200        expensive
1   Tennis Court 2                  200        expensive
2  Badminton Court                   50            cheap
3     Table Tennis                   10            cheap
4   Massage Room 1                 3000        expensive
5   Massage Room 2                 3000        expensive
6     Squash Court                   80            cheap
7    Snooker Table                   15            cheap
8       Pool Table                   15            cheap

### Q6: You'd like to get the first and last name of the last member(s) who signed up. Do not use the LIMIT clause for your solution.

In [51]:
query = '''
SELECT firstname,
       surname
 FROM Members
WHERE joindate = (SELECT MAX(joindate) FROM Members)
'''
q6 = pd.read_sql_query(query, engine)
q6

  firstname surname
0    Darren   Smith

### Q7: How can you produce a list of all members who have used a tennis court? Include in your output the name of the court, and the name of the member formatted as a single column. Ensure no duplicate data, and order by the member name.

In [52]:
query = '''
SELECT f.name AS facility,
       CONCAT(m.firstname, ' ', m.surname) AS name
FROM Bookings b
    JOIN Facilities f
      ON f.facid = b.facid
    JOIN Members m 
      ON m.memid = b.memid
WHERE f.facid IN (0,1)
GROUP BY 1,2
ORDER BY 2
'''
q7 = pd.read_sql_query(query, engine)
q7

          facility               name
0   Tennis Court 1         Anne Baker
1   Tennis Court 2         Anne Baker
2   Tennis Court 2       Burton Tracy
3   Tennis Court 1       Burton Tracy
4   Tennis Court 1       Charles Owen
5   Tennis Court 2       Charles Owen
6   Tennis Court 2       Darren Smith
7   Tennis Court 2      David Farrell
8   Tennis Court 1      David Farrell
9   Tennis Court 1        David Jones
10  Tennis Court 2        David Jones
11  Tennis Court 1       David Pinker
12  Tennis Court 1      Douglas Jones
13  Tennis Court 1      Erica Crumpet
14  Tennis Court 1     Florence Bader
15  Tennis Court 2     Florence Bader
16  Tennis Court 2     Gerald Butters
17  Tennis Court 1     Gerald Butters
18  Tennis Court 2        GUEST GUEST
19  Tennis Court 1        GUEST GUEST
20  Tennis Court 2   Henrietta Rumney
21  Tennis Court 2         Jack Smith
22  Tennis Court 1         Jack Smith
23  Tennis Court 2    Janice Joplette
24  Tennis Court 1    Janice Joplette
25  Tennis Court 1     Jemima Farrell
26  Tennis Court 2     Jemima Farrell
27  Tennis Court 1        Joan Coplin
28  Tennis Court 1          John Hunt
29  Tennis Court 2          John Hunt
30  Tennis Court 1    Matthew Genting
31  Tennis Court 2  Millicent Purview
32  Tennis Court 2         Nancy Dare
33  Tennis Court 1         Nancy Dare
34  Tennis Court 2    Ponder Stibbons
35  Tennis Court 1    Ponder Stibbons
36  Tennis Court 1   Ramnaresh Sarwin
37  Tennis Court 2   Ramnaresh Sarwin
38  Tennis Court 1         Tim Boothe
39  Tennis Court 2         Tim Boothe
40  Tennis Court 2         Tim Rownam
41  Tennis Court 1         Tim Rownam
42  Tennis Court 2      Timothy Baker
43  Tennis Court 1      Timothy Baker
44  Tennis Court 1        Tracy Smith
45  Tennis Court 2        Tracy Smith

### Q8: How can you produce a list of bookings on the day of 2012-09-14 which will cost the member (or guest) more than $30? Remember that guests have different costs to members (the listed costs are per half-hour 'slot'), and the guest user's ID is always 0. Include in your output the name of the facility, the name of the member formatted as a single column, and the cost. Order by descending cost, and do not use any subqueries.

In [53]:
query = '''
SELECT f.name AS facility,
       CONCAT(m.firstname, ' ', m.surname) AS name,
       CASE WHEN b.memid = '0' THEN (b.slots * f.guestcost)
            ELSE (b.slots * f.membercost) END AS cost
FROM Bookings b
    JOIN Facilities f
      ON f.facid = b.facid
    JOIN Members m 
      ON m.memid = b.memid
WHERE b.starttime LIKE '2012-09-14%'
  AND ((m.memid =0 AND b.slots * f.guestcost > 30)
	OR (m.memid !=0 AND b.slots * f.membercost > 30))
ORDER BY 3 DESC
'''
q8 = pd.read_sql_query(query, engine)
q8

ValueError: unsupported format character ''' (0x27) at index 341

### Q9: This time, produce the same result as in Q8, but using a subquery.

In [54]:
query = '''
SELECT member, facility, cost
FROM (

SELECT CONCAT(m.surname, ', ', m.firstname) AS member, 
       f.name AS facility, 
       CASE WHEN m.memid =0 THEN b.slots * f.guestcost
            ELSE b.slots * f.membercost
            END AS cost
      FROM `Members` m
      JOIN `Bookings` b 
        ON m.memid = b.memid
INNER JOIN `Facilities` f 
        ON b.facid = f.facid
WHERE b.starttime LIKE '2012-09-14%') AS bookings
	
WHERE cost > 30
ORDER BY cost DESC
'''
q9 = pd.read_sql_query(query, engine)
q9

ValueError: unsupported format character ''' (0x27) at index 410

### Q10: Produce a list of facilities with a total revenue less than 1000. The output of facility name and total revenue, sorted by revenue. Remember that there's a different cost for guests and members!

In [55]:
query = '''
SELECT f.name AS facility,
       SUM(CASE WHEN b.memid = '0' THEN (b.slots * f.guestcost)
            ELSE (b.slots * f.membercost) END) AS revenue
FROM Bookings b
    JOIN Facilities f
      ON f.facid = b.facid
GROUP BY 1
HAVING revenue < 1000
ORDER BY 2 DESC
'''
q10 = pd.read_sql_query(query, engine)
q10

        facility  revenue
0     Pool Table    270.0
1  Snooker Table    240.0
2   Table Tennis    180.0